# Тема 1. Переменные
# В питоне динамическая типизация данных
# Нам не нужно думать, какой тип данных использовать для объекта
# Переменная - переименованная область памяти в компьютере. Она состоит
# из имени и значения

number_x = 9  # number_x - название переменной. 9 - значение внутри нее.

# В питоне невозможно создать переменную не поместив в нее значение
# number_x = null - такое нельзя

# Значение в переменной можно перезаписывать. Например, было в number_x число 9,
# стало 8:
number_x = 8

# Тема 2. Базовые синтаксис
# Питон - это интерпретируемый язык программирования. Это значит, что команды будут
# выполняться последовательно друг за другом, не зная о том, какая команда будет
# следующей.


# Команды выполняются последовательно, друг за другом, образуя
# алгоритм. Команды могут быть как объявлением переменных, так вызовом других
# функций и т.д.


