# На числовой прямой даны два отрезка: P = [5, 30] и Q = [14, 23]. Укажите наибольшую возможную длину промежутка A,
# для которого формула
#
# ((x ∈ P) ≡ (x ∈ Q)) → ¬(x ∈ A)
#
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.

def f(x, A):
    return not ((x in P) == (x in Q)) or not (x in A)


P = [i/10 for i in range(5*10, 30*10 + 1)]
Q = [i/10 for i in range(14*10, 23*10+1)]
A = set(i/10 for i in range(1*10, 40*10+1))

for x in [i/10 for i in range(1*10, 40*10+1)]:
    if not f(x, A):
        A.remove(x)
print(sorted(A))
